Repository: dalihub/dali-demo
Catalog: resources/po/*.po
Languages: as, de, es, fi, ko, ml, ur

# DALI_DEMO_STR_TITLE_ANIMATED_IMAGES
source: Animated Images
as: অ্যানিমেটেড ইমেজ
de: Animierte Bilder
es: Imágenes animadas
fi: animoituja kuvia
ko: 애니메이션 이미지
ml: അനിമേറ്റഡ് ചിത്രങ്ങൾ
ur: متحرک تصاویر

# DALI_DEMO_STR_TITLE_ANIMATED_SHAPES
source: Animated Shapes
as: অ্যানিমেটেড আকার
de: Animierte Formen
es: Formas Animadas
fi: Animoidut Muodot
ko: 애니메이션 모양
ml: ആനിമേഷൻ രൂപങ്ങൾ
ur: متحرک شکلیں

# DALI_DEMO_STR_TITLE_BASIC_LIGHT
source: Basic Light
as: বেসিক আলো
de: Grundleuchte
es: Iluminación Básica
fi: Perusvalo
ko: 기본 표시 등
ml: അടിസ്ഥാന വെളിച്ചം
ur: بیسک روشنی

# DALI_DEMO_STR_TITLE_BLOCKS
source: Blocks
as: অৱৰুদ্ধ কৰক
de: Blöcke
es: Bloques
fi: Lohko Peli
ko: 블록
ml: തടയപ്പെട്ട
ur: اینٹیں

# DALI_DEMO_STR_TITLE_BUBBLES
source: Bubbles
as: বেলুন
de: Schaumbildung
es: Burbujas
fi: Kuplat
ko: 방울
ml: കുമിള
ur: بلبلے

# DALI_DEMO_STR_TITLE_BUTTONS
source: Buttons
as: ক্লিক্
de: Tasten
es: Botones
fi: Painikkeet
ko: 버튼
ml: ബട്ടണുകൾ
ur: بٹنوں

# DALI_DEMO_STR_TITLE_CALL_ACTIVE
source: Call Active
ko: 통화 수신

# DALI_DEMO_STR_TITLE_CARD_ACTIVE
source: Card Active
ko: NFC 카드 태깅

# DALI_DEMO_STR_TITLE_CLIPPING
source: Clipping
es: Recorte
fi: Leikkaaminen
ko: 깎는
ml: ക്ലിപ്പിംഗ്
ur: کاٹنا

# DALI_DEMO_STR_TITLE_CLIPPING_DRAW_ORDER
source: Clipping Draw Order
ko: 드로잉 순서를 클리핑

# DALI_DEMO_STR_TITLE_COLOR_GRADIENT
source: Colour Gradient
as: ঝুৰ্
de: Farbverlauf
es: Gradiente de color
fi: Liukuväri
ko: 색상 그라디언트
ml: വർണ്ണ ഗ്രേഡിയന്റ്
ur: رنگ میلان

# DALI_DEMO_STR_TITLE_CONTACT_CARDS
source: Contact Cards
as: অঁপইতা
de: Kontakt
es: Contactos
fi: Yhteystietokortit
ko: 접촉
ml: ബന്ധങ്ങൾ
ur: لوگ

# DALI_DEMO_STR_TITLE_CUBE_TRANSITION
source: Cube Effect
as: ঘনক পৰিৱৰ্তনীয় প্ৰভাৱ
de: Würfel Übergangseffekt
es: Transición cubos
fi: Kuutioefekti
ko: 입방체 전환
ml: സമചതുരക്കട്ട സംക്രമണ ഇഫക്ട്
ur: کیوب منتقلی

# DALI_DEMO_STR_TITLE_DISSOLVE_TRANSITION
source: Dissolve Effect
as: পৰিৱৰ্তনীয় প্ৰভাৱ
de: Auflösen Übergangseffekt
es: Transición disolver
fi: Häivytysefekti
ko: 디졸브 전환
ml: സ്ഥാനാന്തരം സംക്രമണ ഇഫക്ട്
ur: حل منتقلی

# DALI_DEMO_STR_TITLE_EFFECTS_VIEW
source: Effects View
as: অকৃতকাৰ্য্য হ
de: Auswirkungen
es: Vista de efectos
fi: Efektinäkymä
ko: 이펙트 뷰
ml: എഫക്റ്റുകൾ
ur: اثرات

# DALI_DEMO_STR_TITLE_EMOJI_TEXT
source: Emoji Text
as: Emoji
de: Emoji
es: Texto con emojis
fi: Teksti Hymiöillä
ko: 이모티콘 텍스트
ml: ഇമോട്ടികോണുകൾ
ur: اموٹکان

# DALI_DEMO_STR_TITLE_FLEXBOX_PLAYGROUND
source: Flexbox Playground
as: Flexbox ডেমো
fi: Flexbox Testi Sovellus
ko: Flexbox 데모
ml: ഫ്ലക്സ്ബോക്സിനുള്ള ഡെമോ
ur: فلیکس باکس ڈیمو

# DALI_DEMO_STR_TITLE_IMAGE_FITTING_SAMPLING
source: Image Fitting and Sampling
as: অনুবিম্ব ইজাৰ
de: Bild Montage und Sampling
es: Modo de encaje y muestreo
fi: Kuvien Sovitus ja Suodatus
ko: 이미지 조정 샘플링
ml: ചിത്രം ഉചിതമാണ് ആൻഡ് ഒരുപറ്റം
ur: تصویر فٹنگ

# DALI_DEMO_STR_TITLE_IMAGE_SCALING
source: Image Scaling Grid
as: প্ৰতিচ্ছবি স্কেল কৰক
de: Bildskalierung
es: Modo de escalado de imagen
fi: Kuvien Skaalaus
ko: 이미지 확대
ml: ഇമേജിംഗ്
ur: تصویر پیمائی

# DALI_DEMO_STR_TITLE_IMAGE_VIEW
source: Image View
as: অনুবিম্ব
de: Bildansicht
es: Control con imagenes
fi: Kuvanäkymä
ko: 이미지 뷰
ml: ചിത്രം കാഴ്ച
ur: تصویر کنٹرول

# DALI_DEMO_STR_TITLE_IMAGE_VIEW_ALPHA_BLENDING
source: Image View Alpha Blending
as: অনুবিম্ব অনুৰেখ পত্ৰ
de: Bildansicht mit Transparenz
es: Control con imagenes con transparencias
fi: Kuvanäkymän Läpinäkyvyysmoodit
ko: 이미지 뷰 알파 블렌딩
ml: ചിത്രം കാഴ്ച
ur: تصویر کنٹرول

# DALI_DEMO_STR_TITLE_IMAGE_VIEW_PIXEL_AREA
source: Image View Pixel Area
as: অনুবিম্ব Pixel Area
de: Bildansicht Pixelbereich
es: Control con imagenes con area de pixeles
fi: Kuvanäkymän Pikselialue
ko: 이미지 뷰 픽셀 영역
ml: സുതാര്യത ഉപയോഗിച്ച് ഇമേജ് കാഴ്ച
ur: تصویر کنٹرول شفافیت کے ساتھ

# DALI_DEMO_STR_TITLE_IMAGE_VIEW_SVG
source: Image View SVG
as: অনুবিম্ব SVG
de: Bildansicht SVG
es: Control con imagenes SVG
fi: SVG Kuvanäkymä
ko: 이미지 뷰 SVG
ml: ചിത്രം കാഴ്ച SVG
ur: تصویر کنٹرول SVG

# DALI_DEMO_STR_TITLE_ITEM_VIEW
source: Item View
as: আইটেম দর্শন
de: Item-Ansicht
es: Vista de elementos
fi: Esinenäkymä
ko: 아이템 뷰
ml: ഇനം കാഴ്ച
ur: چیزوں کی فہرست

# DALI_DEMO_STR_TITLE_LIGHTS_AND_SHADOWS
source: Lights and Shadows
as: ছাঁয়া
de: Licht und Schatten
es: Luces y sombras
fi: Valot ja Varjot
ko: 빛과 그림자
ml: നിഴല്
ur: روشنی اور سائے

# DALI_DEMO_STR_TITLE_LINE_MESH
source: Mesh Line
as: অঁকোৱা-পকোৱা
de: Linien
es: Lineas
fi: Viivapolygoniverkko
ko: 라인 메쉬
ml: വര
ur: لکیریں

# DALI_DEMO_STR_TITLE_MAGNIFIER
source: Magnifier
as: পৰিবৰ্দ্ধক
de: Bildschirmlupe
es: Lupa
fi: Suurennuslasi
ko: 돋보기
ml: ഭൂതക്കണ്ണാടി
ur: مکبر

# DALI_DEMO_STR_TITLE_MESH_MORPH
source: Mesh Morph
as: মেশ অঙ্কুৰিত
de: Mesh Veränderung
es: Transformacion de geometrias
fi: Polygoniverkon Muodonmuutos
ko: 메쉬 형태
ml: മോർഫ് mesh
ur: میش کی تبدیلی

# DALI_DEMO_STR_TITLE_MESH_VISUAL
source: Mesh Visual
as: 3D অনুগামী
de: 3D-Modelle
es: Gemeotria 3D
fi: Polygoniverkkovisuaali
ko: 메쉬 비주얼
ml: 3D മോഡലിങ്
ur: 3D میش

# DALI_DEMO_STR_TITLE_MOTION_BLUR
source: Motion Blur
as: অস্পষ্ট
de: Bewegungsunschärfe
es: Desenfoque de movimiento
fi: Liikesumennus
ko: 모션 블러
ml: അവ്യക്തമാക്കല്
ur: دھندلانے کی حرکت

# DALI_DEMO_STR_TITLE_MOTION_STRETCH
source: Motion Stretch
as: বিস্তাৰ
de: Bewegung Strecke
es: Movimiento con deformación
fi: Liikevenytys
ko: 늘이기
ml: സ്ട്രെച്ച്
ur: کھینچھنے کی حرکت

# DALI_DEMO_STR_TITLE_NATIVE_IMAGE_SOURCE
source: Native Image Source
as: অইন অনুবিম্ব
de: Nativen Bild
es: Fuente de imagenes nativas
fi: Natiivi Kuvalähde
ko: 네이티브 이미지 소스
ml: നേറ്റീവ് ചിത്രം
ur: نیٹو تصویر

# DALI_DEMO_STR_TITLE_NEGOTIATE_SIZE
source: Negotiate Size
as: অকণমান আপোচ কৰ্
de: Größe Verhandlung
es: Negociacion de tamaño
fi: Kokoneuvottelu
ko: 사이즈 조절
ml: വലുപ്പം കൂടിയാലോചന
ur: سائز مذاکرات

# DALI_DEMO_STR_TITLE_POPUP
source: Popup
as: পোপা মেনু
de: Popup-Menü
fi: Ponnahdusikkuna
ko: 팝업
ml: പോപപ്പ് മെനുവിൽ
ur: پاپ اپ

# DALI_DEMO_STR_TITLE_PROGRESS_BAR
source: Progress Bar
as: অগ্রগতি বার
de: Fortschrittsanzeige
es: Barra de progreso
fi: Edistymispalkki
ko: 진행률 표시 줄
ml: പ്രോഗ്രസ് ബാർ
ur: ترقی بار

# DALI_DEMO_STR_TITLE_PRIMITIVE_SHAPES
source: Primitive Shapes
as: অংশ্যমান অৰ্কিড
de: Grundformen
es: Primitvas 3D
fi: Primitiivimuodot
ko: 기본 모양
ml: അടിസ്ഥാന രൂപങ്ങൾ
ur: سادہ ماڈلیے

# DALI_DEMO_STR_TITLE_RADIAL_MENU
source: Radial Menu
as: ৰেডিয়েল নক্সা
de: Radialmenü
es: Menú radial
fi: Säteittäinen Valikko
ko: 레이디 얼 메뉴
ml: റേഡിയല് രേഖാചിത്രം
ur: ریڈیل مینو

# DALI_DEMO_STR_TITLE_REFRACTION
source: Refraction
as: প্ৰতিফলিত কৰক
de: Brechung
es: Refracción
fi: Valon Taittuminen
ko: 굴절 효과
ml: പ്രതിഫലിക്കുക
ur: رفراکشن

# DALI_DEMO_STR_TITLE_RENDERER_STENCIL
source: Renderer Stencil
as: চক্ৰলেখন
de: Schablone
es: Dibujado con stencil
fi: Sapluuna Efekti
ko: 렌더러 스텐실
ml: സീരിയോലിത്തോഗ്രാഫ്
ur: سٹینسل

# DALI_DEMO_STR_TITLE_SCRIPT_BASED_UI
source: Script-based UI
as: লিপি
de: Scripting
es: Interfaz definida por Script
fi: Skriptipohjainen UI
ko: 스크립팅
ml: സ്ക്രിപ്റ്റ്
ur: سکرپٹ

# DALI_DEMO_STR_TITLE_SCROLL_VIEW
source: Scroll View
as: স্ক্ৰ'ল কৰক
de: Scroll-Ansicht
es: Vista de desplazamiento
fi: Vieritysnäkymä
ko: 스크롤 뷰
ml: സ്ക്രോള്ചെയ്യുക കാഴ്ച
ur: سکرول ویو

# DALI_DEMO_STR_TITLE_SPARKLE
source: Sparkle
as: তাৰকা
de: Funkeln
es: Brillar
fi: Kimalteluefekti
ko: 불꽃
ml: നക്ഷത്ര
ur: سٹار

# DALI_DEMO_STR_TITLE_STYLING
source: Styling
as: শৈলী
es: Estilo
fi: UI Tyyli
ko: 스타일링
ml: ശൈലി
ur: سٹائل

# DALI_DEMO_STR_TITLE_TEXTURED_MESH
source: Mesh Texture
as: টেক্সটারেদ মেশ
de: Strukturiertem Mesh
es: Geometria con texturas
fi: Teksturoitu Polygoniverkko
ko: 텍스쳐 메쉬
ml: ടെക്സ്ചർ mesh
ur: ٹیکسچرد میش

# DALI_DEMO_STR_TITLE_TEXT_EDITOR
source: Text Editor
as: অকনিষ্ঠ আনুবংশিক
es: Editor de texto
fi: Tekstieditori
ko: 텍스트 편집기
ml: ടെക്സ്റ്റ് എഡിറ്റർ
ur: حروف ایڈیٹر

# DALI_DEMO_STR_TITLE_TEXT_FIELD
source: Text Field
as: অকনিষ্ঠ অগ্ৰণী
de: Textfeld
es: Campo de texto
fi: Tekstikenttä
ko: 텍스트 필드
ml: ടെക്സ്റ്റ് ഫീൽഡ്
ur: حروف لائن ایڈیٹر

# DALI_DEMO_STR_TITLE_TEXT_LABEL
source: Text Label
as: লেৱেল কৰক
de: Beschriftung
es: Etiqueta de texto
fi: Tekstietiketti
ko: 텍스트 라벨
ml: ലേബലുചെയ്യുക
ur: حروف کا لیبل

# DALI_DEMO_STR_TITLE_TEXT_LABEL_MULTI_LANGUAGE
source: Text Scripts
as: অক্ষশক্তি অঁকা অকনিষ্ঠ
de: Mehrere Sprachen Beschriftung
es: Textos internacionales
fi: Monikielinen Teksti
ko: 다국어
ml: ഒന്നിലധികം ഭാഷ വാചകം
ur: کئی زبانوں

# DALI_DEMO_STR_TITLE_TEXT_SCROLLING
source: Text Scrolling
as: অকনিষ্ঠ অৰ্জুন বঁটা
de: Text Scrollen
es: Texto con desplazamiento
fi: Tekstin Vieritys
ko: 텍스트 스크롤
ml: ടെക്സ്റ്റ് സ്ക്രോളിംഗ്
ur: حروف کاسکرال

# DALI_DEMO_STR_TITLE_TILT_SENSOR
source: Tilt Sensor
as: টিল্ট অনুভূতি
de: Neigungssensor
es: Sensor de inclinacion
fi: Kallistustunnistin
ko: 기울기 센서
ml: ചെരിവ് സെൻസർ
ur: ٹلٹ سینسر

# DALI_DEMO_STR_TITLE_TOOLTIP
source: Tooltip
de: Kurzinfo
ko: 툴팁
ml: കൂടുതൽ വിവരങ്ങൾ
ur: مزید معلومات

# DALI_DEMO_STR_TITLE_RENDERING_TEXTURED_CUBE
source: Textured cube
as: ৰেণ্ডাৰিং গাঁথনি
de: Texturierter Würfel
es: Cubo con textura
fi: kuvioitu kuutio
ko: 질감 입방체
ml: ടെക്സ്ചർ ക്യൂബ്
ur: بویک ٹوانب

# DALI_DEMO_STR_TITLE_RENDERING_DRAW_CUBE
source: Draw cube
as: ৰেণ্ডাৰিং ঘনক
de: Würfel zeichnen
es: Dibujar cubo
fi: piirtää kuutio
ko: 큐브 그리기
ml: ക്യൂബ് വരയ്ക്കുക
ur: ارڈ بویک

# DALI_DEMO_STR_TITLE_RENDERING_DRAW_TRIANGLE
source: Draw triangle
as: ৰেণ্ডাৰিং ত্ৰিকোণমিতি
de: Dreieck zeichnen
es: Dibujar triángulo
fi: Piirrä kolmio
ko: 삼각형 그리기
ml: ത്രികോണം വരയ്ക്കുക
ur: ارڈ ثلثم

# DALI_DEMO_STR_TITLE_RENDERING_DRAW_LINE
source: Draw line
as: ৰেণ্ডাৰিং শাৰী
de: Zeichnen
es: Dibujar linea
fi: Draw linja
ko: 선 그리기
ml: സമനില ലൈൻ
ur: انچنیھک ریکل

# DALI_DEMO_STR_TITLE_RENDERING_RADIAL_PROGRESS
source: Draw radial progress
as: রশ্মীয় অগ্রগতি অঙ্কন
de: Radialer Fortschritt zeichnen
es: Dibujo progreso radial
fi: Piirustus radial edistyminen
ko: 방사형 진행 상황 그리기
ml: റേഡിയൽ പുരോഗതി ഡ്രോയിംഗ്
ur: ریڈیل پیش رفت ڈرائنگ

# DALI_DEMO_STR_TITLE_RENDERING_RAY_MARCHING
source: Ray Marching
as: রে মার্চিং
de: Ray marschieren
es: trazado de rayos
fi: Ray marssi
ko: 레이 마칭
ml: ലൈറ്റ് മാർച്ചിംഗ്
ur: رے چلتے

# DALI_DEMO_STR_TITLE_FPP_GAME
source: FPP Game
as: FPP খেলা
de: FPP Spiel
es: Juego FPP
fi: FPP peli
ur: FPP گیم
